In [165]:
#Dependencies
import pandas as pd

In [166]:
#Assign variable to read csv file
school_path="../Resources/schools_complete.csv"
student_path="../Resources/students_complete.csv"
print(school_path)

../Resources/schools_complete.csv

In [167]:
#Create Panda dataframes by reading csv file
school_df=pd.read_csv(school_path)
student_df=pd.read_csv(student_path)

In [168]:
#Merge 2 tables provided;student info table, school table
complete_df=pd.merge(student_df, school_df, how="left", on=["school_name","school_name"])
complete_df

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
...,...,...,...,...,...,...,...,...,...,...,...
39165,39165,Donna Howard,F,12th,Thomas High School,99,90,14,Charter,1635,1043130
39166,39166,Dawn Bell,F,10th,Thomas High School,95,70,14,Charter,1635,1043130
39167,39167,Rebecca Tanner,F,9th,Thomas High School,73,84,14,Charter,1635,1043130
39168,39168,Desiree Kidd,F,10th,Thomas High School,99,90,14,Charter,1635,1043130
39169,39169,Carolyn Jackson,F,11th,Thomas High School,95,75,14,Charter,1635,1043130

In [169]:
#SUMMARY - summary_p1_mean_df
##average math score, average reading score
#groupby per school and find mean 

summary_p1_df=complete_df.groupby(["school_name"])

summary_p1_mean_df=summary_p1_df.mean()

summary_p1_mean_df

#Rename coluuns
summary_p1_mean_df=summary_p1_mean_df.rename(columns={"reading_score":"Average Reading Score","math_score":"Average Math Score",})

#reset index to ensure school_name is a column
summary_p1_mean_df.reset_index(inplace=True)
summary_p1_mean_df

#add column called school_name
#summary_p1_mean_df=summary_p1_mean_df.


#delete column
#summary_p1_mean_df=summary_p1_mean_df.drop(columns=["School ID"])
#school_df

,school_name,Student ID,Average Reading Score,Average Math Score,School ID,size,budget
0,Bailey High School,20358.5,81.033963,77.048432,7.0,4976.0,3124928.0
1,Cabrera High School,16941.5,83.975780,83.061895,6.0,1858.0,1081356.0
2,Figueroa High School,4391.0,81.158020,76.711767,1.0,2949.0,1884411.0
3,Ford High School,36165.0,80.746258,77.102592,13.0,2739.0,1763916.0
4,Griffin High School,12995.5,83.816757,83.351499,4.0,1468.0,917500.0
5,Hernandez High School,9944.0,80.934412,77.289752,3.0,4635.0,3022020.0
6,Holden High School,23060.0,83.814988,83.803279,8.0,427.0,248087.0
7,Huang High School,1458.0,81.182722,76.629414,0.0,2917.0,1910635.0
8,Johnson High School,32415.0,80.966394,77.072464,12.0,4761.0,3094650.0
9,Pena High School,23754.5,84.044699,83.839917,9.0,962.0,585858.0
10,Rodriguez High School,28035.0,80.744686,76.842711,11.0,3999.0,2547363.0
11,Shelton High School,6746.0,83.725724,83.359455,2.0,1761.0,1056600.0
12,Thomas High School,38352.0,83.848930,83.418349,14.0,1635.0,1043130.0
13,Wilson High School,14871.0,83.989488,83.274201,5.0,2283.0,1319574.0
14,Wright High School,25135.5,83.955000,83.682222,10.0,1800.0,1049400.0

In [170]:
complete_df.groupby(["school_name"])

In [171]:
#Reading the csv file for information

# Print headings of dataframes, first 5 rows of the school and student dataframes
print(school_df.columns)
print(student_df.columns)

print(f"{school_df.head()}\n\n------------------------------------------------------\n\n")
print(student_df.head())

print(f"Total items in school_df:{len(school_df)}")
print(f"Total items in student_df:{len(student_df)}")

Index(['School ID', 'school_name', 'type', 'size', 'budget'], dtype='object')
Index(['Student ID', 'student_name', 'gender', 'grade', 'school_name',
       'reading_score', 'math_score'],
      dtype='object')
   School ID            school_name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

------------------------------------------------------


   Student ID       student_name gender grade        school_name  \
0           0       Paul Bradley      M   9th  Huang High School
1           1       Victor Smith      M  12th  Huang High School
2           2    Kevin Rodriguez      M  12th  Huang High School
3           3  Dr. Richard Scott      M  12th  Huang High School
4           4         Bonnie Ray      F   9th  Huang High School

   reading_score  math_score
0             66          79
1             94          61
2             90          60
3             67          58
4             97          84
Total items in school_df:15
Total items in student_df:39170

In [172]:
#DISTRICT SUMMARY#
print("DISTRICT SUMMARY\n----------------")

#Count the total number of schools and assign to total_schools variable
total_schools=school_df["school_name"].count()
print(f"Total Schools: {total_schools}")

#Sum total number of students
total_students=school_df["size"].sum()
print(f"Total Students: {total_students}")

#Sum total budget
total_budget=school_df["budget"].sum()
print(f"Total Budget: ${total_budget:,}")

DISTRICT SUMMARY
----------------
Total Schools: 15
Total Students: 39170
Total Budget: $24,649,428

In [173]:
#Average Maths Score
##TEST: avg_math_score=student_df["math_score"].sum()/total_students
avg_math_score=student_df["math_score"].mean()
print(f"Average Math Score: {avg_math_score:.1f}")

#Average Reading Score
##TEST: avg_reading_score=student_df["reading_score"].sum()/total_students
avg_reading_score=student_df["reading_score"].mean()
print(f"Average Reading Score: {avg_reading_score:.1f}")

Average Math Score: 79.0
Average Reading Score: 81.9

In [174]:
#Percentage Passing Math (The percentage of students that passed Math)
students_pass_math=student_df[student_df["math_score"]>=70].count()["student_name"]
#print(students_pass_math)

#count_student_name_path_math
#ssstudents_pass_math=student_df.loc[student_df["math_score"]>=70,:]

# TEST to get an idea of min, max, median and avg score: 
#print(student_df.describe())

percent_pass_math=students_pass_math/total_students*100
print(f"Percentage Students Passing Maths: {percent_pass_math:.2f}%")

#Percentage passing Reading (The percentage of students that passed Reading)
students_pass_reading=student_df[student_df["reading_score"]>=70].count()["student_name"]
percent_pass_reading=students_pass_reading/total_students*100
print(f"Percentage Students Passing Reading: {percent_pass_reading:.2f}%")

#Percentage passing Math and Reading
#students_pass_both=(student_df[student_df["math_score"]>=70].count() student_df[student_df["reading_score"]>=70].count())["student_name"]

students_pass_both=(student_df[(student_df["math_score"]>=70) & (student_df["reading_score"]>=70)]).count()["student_name"]
#print(students_pass_both)
percent_pass_both=students_pass_both/total_students*100
print(f"Percentage Students Passing Both: {percent_pass_both:.2f}%")

#percent_pass_both=students_pass_both/total_students*100
#print(f"Percentage Overall Passing: {percent_pass_both:.2f}%")

Percentage Students Passing Maths: 74.98%
Percentage Students Passing Reading: 85.81%
Percentage Students Passing Both: 65.17%

In [175]:
#DISTRICT SUMMARY TABLE

total_budget_print=total_budget
dis_summary_df=pd.DataFrame({"Total Schools":[total_schools],"Total Students": [total_students],"Total Budget":[total_budget],"Average Math Score":[avg_math_score],"Average Reading Score":[avg_reading_score],"% Passing Math":[percent_pass_math],"% Passing Reading":[percent_pass_reading],"%Overall Passing":[percent_pass_both]})
dis_summary_df
dis_summary_df["Total Budget"]=dis_summary_df["Total Budget"].map("${:,}".format)
dis_summary_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,%Overall Passing
0,15,39170,"$24,649,428",78.985371,81.87784,74.980853,85.805463,65.172326

In [176]:
#This section groupby the school_name. The columns are : 1) total students that passed math; math_groupby_df 2) total students that passed reading;reading_groupby_df
# With 2 columns: math_reading_groupby_df

######MATH PASS (BOOLEAN) GROUPBY SCHOOL NAME#####
#bool_df is the table with columns of math_score_pass
bool_math_df=complete_df

bool_math_df["bool_math_pass"]=bool_math_df["math_score"]>=70
bool_math_df

#delete columns
bool_math_df=bool_math_df.drop(columns=["Student ID","gender","grade","School ID", "type","size","budget","reading_score","math_score","student_name"])
bool_math_df

bool_math_pass_df=bool_math_df[bool_math_df.bool_math_pass==True]
bool_math_pass_df
math_groupby_df=bool_math_pass_df.groupby(["school_name"]).count()

#number of students that passed math grouped by school
math_groupby_df

#reset index to ensure school_name is a column
math_groupby_df.reset_index(inplace=True)
print(math_groupby_df)


######READING PASS (BOOLEAN) GROUPBY SCHOOL NAME#####

bool_reading_df=complete_df
bool_reading_df["bool_reading_pass"]=bool_reading_df["reading_score"]>=70
bool_reading_df

#deletes columns
bool_reading_df=bool_reading_df.drop(columns=["Student ID","gender","grade","School ID", "type","size","budget","reading_score","math_score","student_name","bool_math_pass"])
bool_reading_df

bool_reading_pass_df=bool_reading_df[bool_reading_df.bool_reading_pass==True]
bool_reading_pass_df
reading_groupby_df=bool_reading_pass_df.groupby(["school_name"]).count()

#number of students that passed math grouped by school
reading_groupby_df

#reset index to ensure school_name is a column
reading_groupby_df.reset_index(inplace=True)
print(reading_groupby_df)

#################################################################################
#Merge dfs together for bool_math_pass and bool_reading_pass columns
math_reading_groupby_df=pd.merge(math_groupby_df,reading_groupby_df, on="school_name" ,how="outer")
math_reading_groupby_df
#Use this df to merge to summary_v2_df

              school_name  bool_math_pass
0      Bailey High School            3318
1     Cabrera High School            1749
2    Figueroa High School            1946
3        Ford High School            1871
4     Griffin High School            1371
5   Hernandez High School            3094
6      Holden High School             395
7       Huang High School            1916
8     Johnson High School            3145
9        Pena High School             910
10  Rodriguez High School            2654
11    Shelton High School            1653
12     Thomas High School            1525
13     Wilson High School            2143
14     Wright High School            1680
              school_name  bool_reading_pass
0      Bailey High School               4077
1     Cabrera High School               1803
2    Figueroa High School               2381
3        Ford High School               2172
4     Griffin High School               1426
5   Hernandez High School               3748
6      Holden High School                411
7       Huang High School               2372
8     Johnson High School               3867
9        Pena High School                923
10  Rodriguez High School               3208
11    Shelton High School               1688
12     Thomas High School               1591
13     Wilson High School               2204
14     Wright High School               1739

              school_name  bool_math_pass  bool_reading_pass
0      Bailey High School            3318               4077
1     Cabrera High School            1749               1803
2    Figueroa High School            1946               2381
3        Ford High School            1871               2172
4     Griffin High School            1371               1426
5   Hernandez High School            3094               3748
6      Holden High School             395                411
7       Huang High School            1916               2372
8     Johnson High School            3145               3867
9        Pena High School             910                923
10  Rodriguez High School            2654               3208
11    Shelton High School            1653               1688
12     Thomas High School            1525               1591
13     Wilson High School            2143               2204
14     Wright High School            1680               1739

In [177]:
#SUMMARY - school_df

#Rename coluuns
school_df=school_df.rename(columns={"size":"Total Students","type":"School Type","budget":"Total School Budget"})
school_df

#delete column
school_df=school_df.drop(columns=["School ID"])
school_df

              school_name School Type  Total Students  Total School Budget
0       Huang High School    District            2917              1910635
1    Figueroa High School    District            2949              1884411
2     Shelton High School     Charter            1761              1056600
3   Hernandez High School    District            4635              3022020
4     Griffin High School     Charter            1468               917500
5      Wilson High School     Charter            2283              1319574
6     Cabrera High School     Charter            1858              1081356
7      Bailey High School    District            4976              3124928
8      Holden High School     Charter             427               248087
9        Pena High School     Charter             962               585858
10     Wright High School     Charter            1800              1049400
11  Rodriguez High School    District            3999              2547363
12    Johnson High School    District            4761              3094650
13       Ford High School    District            2739              1763916
14     Thomas High School     Charter            1635              1043130

In [178]:
summary_p1_mean_df

,school_name,Student ID,Average Reading Score,Average Math Score,School ID,size,budget
0,Bailey High School,20358.5,81.033963,77.048432,7.0,4976.0,3124928.0
1,Cabrera High School,16941.5,83.975780,83.061895,6.0,1858.0,1081356.0
2,Figueroa High School,4391.0,81.158020,76.711767,1.0,2949.0,1884411.0
3,Ford High School,36165.0,80.746258,77.102592,13.0,2739.0,1763916.0
4,Griffin High School,12995.5,83.816757,83.351499,4.0,1468.0,917500.0
5,Hernandez High School,9944.0,80.934412,77.289752,3.0,4635.0,3022020.0
6,Holden High School,23060.0,83.814988,83.803279,8.0,427.0,248087.0
7,Huang High School,1458.0,81.182722,76.629414,0.0,2917.0,1910635.0
8,Johnson High School,32415.0,80.966394,77.072464,12.0,4761.0,3094650.0
9,Pena High School,23754.5,84.044699,83.839917,9.0,962.0,585858.0
10,Rodriguez High School,28035.0,80.744686,76.842711,11.0,3999.0,2547363.0
11,Shelton High School,6746.0,83.725724,83.359455,2.0,1761.0,1056600.0
12,Thomas High School,38352.0,83.848930,83.418349,14.0,1635.0,1043130.0
13,Wilson High School,14871.0,83.989488,83.274201,5.0,2283.0,1319574.0
14,Wright High School,25135.5,83.955000,83.682222,10.0,1800.0,1049400.0

In [179]:
###SUMMARY - VERSION 1 , summary_v1_df
summary_v1_df=pd.merge(school_df,summary_p1_mean_df, on="school_name" ,how="outer")
summary_v1_df

#delete columns
summary_v1_df=summary_v1_df.drop(columns=["Student ID", "School ID", "size", "budget"])
summary_v1_df

,school_name,School Type,Total Students,Total School Budget,Average Reading Score,Average Math Score
0,Huang High School,District,2917,1910635,81.182722,76.629414
1,Figueroa High School,District,2949,1884411,81.158020,76.711767
2,Shelton High School,Charter,1761,1056600,83.725724,83.359455
3,Hernandez High School,District,4635,3022020,80.934412,77.289752
4,Griffin High School,Charter,1468,917500,83.816757,83.351499
5,Wilson High School,Charter,2283,1319574,83.989488,83.274201
6,Cabrera High School,Charter,1858,1081356,83.975780,83.061895
7,Bailey High School,District,4976,3124928,81.033963,77.048432
8,Holden High School,Charter,427,248087,83.814988,83.803279
9,Pena High School,Charter,962,585858,84.044699,83.839917
10,Wright High School,Charter,1800,1049400,83.955000,83.682222
11,Rodriguez High School,District,3999,2547363,80.744686,76.842711
12,Johnson High School,District,4761,3094650,80.966394,77.072464
13,Ford High School,District,2739,1763916,80.746258,77.102592
14,Thomas High School,Charter,1635,1043130,83.848930,83.418349

In [180]:
summary_v2_df=pd.merge(summary_v1_df,math_reading_groupby_df, on="school_name",how="outer")
summary_v2_df

,school_name,School Type,Total Students,Total School Budget,Average Reading Score,Average Math Score,bool_math_pass,bool_reading_pass
0,Huang High School,District,2917,1910635,81.182722,76.629414,1916,2372
1,Figueroa High School,District,2949,1884411,81.158020,76.711767,1946,2381
2,Shelton High School,Charter,1761,1056600,83.725724,83.359455,1653,1688
3,Hernandez High School,District,4635,3022020,80.934412,77.289752,3094,3748
4,Griffin High School,Charter,1468,917500,83.816757,83.351499,1371,1426
5,Wilson High School,Charter,2283,1319574,83.989488,83.274201,2143,2204
6,Cabrera High School,Charter,1858,1081356,83.975780,83.061895,1749,1803
7,Bailey High School,District,4976,3124928,81.033963,77.048432,3318,4077
8,Holden High School,Charter,427,248087,83.814988,83.803279,395,411
9,Pena High School,Charter,962,585858,84.044699,83.839917,910,923
10,Wright High School,Charter,1800,1049400,83.955000,83.682222,1680,1739
11,Rodriguez High School,District,3999,2547363,80.744686,76.842711,2654,3208
12,Johnson High School,District,4761,3094650,80.966394,77.072464,3145,3867
13,Ford High School,District,2739,1763916,80.746258,77.102592,1871,2172
14,Thomas High School,Charter,1635,1043130,83.848930,83.418349,1525,1591

In [181]:
summary_v2["% Passing Math"]=summary_v2["bool_math_pass"]/summary_v2["Total Students"]
summary_v2

NameError: name 'summary_v2' is not defined